IDS_RUS_CODE_REPORT_EN_TEST = "EC_Report_EN-Test(Lang:EN)"
IDS_RUS_DLL_ERROR = "Используется неверная версия dll"
IDS_RUS_DLL_ERROR_REPORT = "Не удалось инициализировать COM dll"
IDS_CVL_REPORT_PRINTING = "Печать отчета..."
IDS_CVL_REPORT_GENERATING = "Формирование отчета..."
IDS_CVL_RPT_SNiP_Spartial_Section = "Расчет по прочности пространственных сечений"
IDS_CVL_RPT_SNiP_Not_required = "не требуется"
IDS_SP16_Par711_Title = "Расчет на прочность элементов при центральном растяжении или сжатии (пар. 7.1.1)"
IDS_SP16_Par713_Title = "Расчет на устойчивость элементов сплошного сечения при центральном сжатии (пар. 7.1.3)"
IDS_SP16_Par715_Title = "Устойчивость при изгибно-крутильной форме потери устойчивости открытого профиля (швеллер) (пар. 7.1.5)"
IDS_SP16_Par723_Title = "Вычисление условной гибкости отдельной ветви (пар. 7.2.3)"
IDS_SP16_Par724_Title = "Вычисление устойчивости отдельных ветвей в сквозных элементах (пар. 7.2.4)"
IDS_SP16_Par732_Title = "Устойчивость стенок центрально сжатых элементов сплошного сечения (пар. 7.3.2)"
IDS_SP16_Par733_Title = "Стенки центрально сжатых элементов сплошного сечения следует укреплять поперечными ребрами (пар. 7.3.3)"
IDS_SP16_Par733_CrossRibsNotSet = "o_lambda_w > 2.3\n\nНеобходимо установить поперечные ребра."
IDS_SP16_Par733_CheckCrossRibFrequency = "o_lambda_w > 2.3\n\nПопереные ребра установлены. Проверка достаточности частоты их установки:"
IDS_SP16_Par733_CrossRibsAreNotRequired = "o_lambda_w <= 2.3\n\nУстановка поперечных ребер не требуется."
IDS_SP16_Par738_Title = "Устойчивость поясных листов (полок) центрально сжатых элементов сплошного сечения (пар. 7.3.8)"
IDS_SP16_Par821_Title = "Расчет на прочность балок 1-го класса: при действии момента (пар. 8.2.1)"
IDS_SP16_ParTau_Title = "Проверка сечения на сдвигающие силы"
IDS_SP16_Par823_Title = "Расчет на прочность разрезных балок 2-го и 3-го классов двутаврового и коробчатого сечений: при действии момента (пар. 8.2.3)"
IDS_SP16_Par841_Title = "Расчет на устойчивость двутавровых балок 1-го класса: при действии момента (пар. 8.4.1)"
IDS_SP16_Par851_Title = "Устойчивость стенок балок 1-го класса: при действии момента (пар. 8.5.1)"
IDS_SP16_Par853_Title = "Устойчивость стенок балок 1-го класса симметричного сечения при наличии местного напряжения: при действии момента (пар. 8.5.3)"
IDS_SP16_Par857_Title = "Устойчивость стенок балок 1-го класса асимметричного двутаврового сечения с более развитым растянутым поясом (пар. 8.5.7)"
IDS_SP16_Par858_Title = "Устойчивость стенок балок 2-го и 3-го классов из однородной стали при отсутствии местного напряжения (Sigma_loc = 0) (пар. 8.5.8)"
IDS_SP16_Par822_Title = "Расчет на прочность стенки балки, не укрепленной ребрами жесткости, при действии местного напряжения Sigma_lос (пар. 8.2.2)"
IDS_SP16_Par8518_Title = "Устойчивость сжатых поясов балок 1-го класса (пар. 8.5.18)"
IDS_SP16_Par8519_Title = "Устойчивость сжатых поясов балок 2,3-го класса (пар. 8.5.19)"
IDS_SP16_Par911_Title = "Расчет на прочность внецентренно сжатых и внецентренно растянутых элементов (пар. 9.1.1)"
IDS_SP16_Par913_Title = "Проверка на прочность растянутого волокна сечения внецентренно сжатых элементов, с несимметричными сечениями (пар. 9.1.3)"
IDS_SP16_Par922_Title = "Расчет на устойчивость внецентренно сжатых элементов в плоскости действия момента, совпадающей с плоскостью симметрии (пар. 9.2.2)"
IDS_SP16_Par928_Title = "Расчет на устойчивость внецентренно сжатых элементов, изгибаемых в плоскости наименьшей жесткости (пар. 9.2.8)"
IDS_SP16_Par929_Title = "Расчет на устойчивость стержней (кроме коробчатого), подверженных сжатию и изгибу в двух главных плоскостях (пар. 9.2.9)"
IDS_SP16_Par9210_Title = "Расчет на устойчивость стержней (коробчатого), подверженных сжатию и изгибу в двух главных плоскостях (пар. 9.2.10)"
IDS_SP16_Par924_Title = "Расчет на устойчивость внецентренно сжатых стержней из плоскости действия момента при изгибе их в плоскости наибольшей жесткости (пар. 9.2.4)"
IDS_SP16_Par942_Title = "Устойчивость стенок внецентренно сжатых элементов (пар. 9.4.2)"
IDS_SP16_Par947_Title = "Устойчивость поясов (полок) внецентренно сжатых стержней (пар. 9.4.7)"
IDS_SP16_Par1041_Title = "Предельные расчетные длины элементов (пар. 10.4.1)"
IDS_SP16_Par1122_Title = "Расчет на устойчивость стенок бесшовных или электросварных труб (пар. 11.2.2)"
IDS_SP16_Par1122_FurtherChecksAreNotNeeded = "o_lambda < 0.65\n Дальнейшие проверки выполнять не требуется."
IDS_SP16_COEFFS_FOR_SECTION_TYPE = "Для сечения типа %s коэффициенты: %s"
IDS_SP16_COEFFS_FOR_UNKNOWN_SECTION_TYPE = "Неизвестный тип сечения. Коэффициенты: %s"
IDS_SP16_CALC_LAMBDA_EF_COMBINED_SECTION = "Расчет гибкости lambda_ef элемента сквозного сечения"
IDS_SP16_COMB_SECT_TYPE1_BRANCHES_WITH_PLANKS = "Тип сечения: 1, ветви соединены планками"
IDS_SP16_COMB_SECT_TYPE1_BRANCHES_WITH_LATTICE = "Тип сечения: 1, ветви соединены решетками"
IDS_SP16_CALC_PHI_COEFF = "Вычисление коэффициента phi"
IDS_SP16_CALC_PHI_E_REG_ELEMENT = "Вычисление коэффициента устойчивости phi_e при внецентренном сжатии сплошностенчатых стержней "
IDS_SP16_CALC_PHI_E_FROM_D3_TABLE = "Из таблицы Д.3 для o_lambda_ef = %g и m = %g"
IDS_SP16_CALC_PHI_E_COMB_ELEMENT = "Вычисление коэффициента устойчивости Phi_e при внецентренном сжатии сквозных стержней"
IDS_SP16_CALC_PHI_E_FROM_D4_TABLE = "Из таблицы Д.4 для o_lambda_ef = %g и m = %g"
IDS_SP16_CALC_REDUCED_AREA_AD = "Вычисление редуцированной площади Ad"
IDS_SP16_SECT_TYPE_TABLE_7 = "Тип сечения из таблицы 7:"
IDS_SP16_REQUIREMENTS_OF_732_NOT_SATISFIED = "Требования параграфа 7.3.2 не выполнены. Вычисления редуцированной площади."
IDS_SP16_REQUIREMENTS_OF_942_NOT_SATISFIED = "Требования параграфа 9.4.2 не выполнены. Вычисления редуцированной площади."
IDS_SP16_CALCULATION_OF_TABLE_9 = "Вычисление предельной условной гибкости стенки (табл. 9)."
IDS_SP16_CALCULATION_OF_TABLE_10 = "Вычисление предельной условной гибкости свеса пояса (полки) (табл. 10)."
IDS_SP16_CALCULATION_OF_HD_CENTRALLY_COMPRESSED = "Вычисление hd для центренно сжатых элементов"
IDS_SP16_CALCULATION_OF_HD_CENTRALLY_UNCOMPRESSED = "Вычисление hd для центренно растянутых элементов"
IDS_SP16_CALCULATION_OF_BD = "Вычисление bd"
IDS_SP16_CALCULATION_OF_TABLE_D6 = "Вычисление ω, α, β (табл. Д.6)"
IDS_SP16_CALCULATION_OF_CMAX_SECT_TYPE_4 = "Вычисление коэффициента Cmax. Тип сечения: 4"
IDS_SP16_CALCULATION_OF_TABLE_E1 = "Вычисление коэффициентов Cy, Cz, n (табл. Е.1)."
IDS_SP16_FOR_AF_AW_MSG = "Для Af = %g, Aw = %g"
IDS_SP16_CALCULATION_TABLE_ZH4 = "Вычисление коэффициента B (табл. Ж.4)."
IDS_SP16_CALCULATION_TABLE_ZH5 = "Вычисление коэффициентов C и D (табл. Ж.5)."
IDS_SP16_UNIT_LENGTH_MM = "мм"
IDS_SP16_UNIT_LENGTH_CM = "см"
IDS_SP16_UNIT_LENGTH_M = "м"
IDS_SP16_UNIT_LENGTH_IN = "дюйм"
IDS_SP16_UNIT_LENGTH_FT = "фут"
IDS_SP16_UNIT_FORCE_KG = "кг"
IDS_SP16_UNIT_FORCE_TON = "тонн"
IDS_SP16_UNIT_FORCE_N = "Н"
IDS_SP16_UNIT_FORCE_KN = "кН"
IDS_SP16_UNIT_FORCE_LBF = "фунт"
IDS_SP16_UNIT_FORCE_KIP = "кип"
IDS_SP16_UNIT_FORCE_KIPs = "kips"
IDS_SP16_RATIO = "кисп"
IDS_SNiP_REPORT_SECT_REDESIGN = "Сечение необходимо переработать."
IDS_SNiP_REPORT_NOT_REQ_REBAR = "Не треб. поперечное армир."
IDS_SNiP_REPORT_REQ_REBAR = "Требуется поперечное арм."
IDS_RUS_CODE_REPORT_CH_TEST = "RUS_Report_CH-Test(Lang:CH)"
IDS_RUS_CODE_REPORT_JP_TEST = "EC_Report_JP-Test(Lang:JP)"
IDS_RUS_CODE_REPORT_KR_TEST = "EC_Report_KR-Test(Lang:KR)"
IDS_RUS_CODE_RUS_TEST = "EC_Report_RUS-Test(Lang:RUS)"
IDS_RUS_CODE_REPORT_TW_TEST = "EC_Report_TW-Test(Lang:TW)"
IDS_SP16_BIG_MY_LINEAR_INTERPOLATION_NOTE = "Значение m_y > 5. Определение значения %s линейной интерполяцией."
